CSI API ETABS v1

# cDetailingStartDetailing Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int StartDetailing(
    	bool OverwriteExisting
    )

    Function StartDetailing (
    	OverwriteExisting As Boolean
    ) As Integer

    Dim instance As cDetailing
    Dim OverwriteExisting As Boolean
    Dim returnValue As Integer

    returnValue = instance.StartDetailing(OverwriteExisting)

    int StartDetailing(
    	bool OverwriteExisting
    )

    abstract StartDetailing :
            OverwriteExisting : bool -> int

#### Parameters

OverwriteExisting

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cDetailing Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com